Tekla Open API Reference for Tekla Structures 2025
Assembly.CompareTo Method (Assembly)
 Compares the instantiated assembly with another one.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CompareTo(
	Assembly AssemblyToCompare
)
Public Function CompareTo (
	AssemblyToCompare As Assembly
) As Boolean
Parameters
AssemblyToCompare
Type: Tekla.Structures.Model.Assembly
The assembly to compare with.
Return Value
Type: Boolean
True if there are no differences, false otherwise.
Remarks
 If the numbering hasn't been performed the function will also return false.
See Also
Reference
Assembly Class
CompareTo Overload
Tekla.Structures.Model Namespace